# -*- coding: utf8 -*-
import configparser
import os


class ConfigFile:
    def __init__(self):
        global language_interface, method_recognition, browser_path, path_to_screenshots
        self.config = configparser.ConfigParser()
        if not os.path.exists("config.ini"):
            self.config.add_section("UserConfig")
            self.config.set("UserConfig", "language_interface", "Русский")
            self.config.set("UserConfig", "method_recognition", "Online")
            self.config.set("UserConfig", "browser_path", "")
            self.config.set("UserConfig", "screenshots", "")

            with open("config.ini", "w") as config_file:
                self.config.write(config_file)

        else:
            try:
                self.config.read("config.ini")
                language_interface = self.config.get("UserConfig", "language_interface")
                method_recognition = int(self.config.get("UserConfig", "method_recognition"))
                browser_path = self.config.get("UserConfig", "browser_path")
                path_to_screenshots = self.config.get("UserConfig", "screenshots")
            except:
                os.remove("config.ini")
                ConfigFile()

    def save(self):
        global language_interface, method_recognition, browser_path
        self.config.set("UserConfig", "language_interface", language_interface)
        self.config.set("UserConfig", "method_recognition", str(method_recognition))
        self.config.set("UserConfig", "browser_path", browser_path)
        self.config.set("UserConfig", "screenshots", path_to_screenshots)

        with open("config.ini", "w") as config_file:
            self.config.write(config_file)
            config_file.close()
        print("Saved configs")


language_interface = "Русский"
method_recognition = 0
browser_path = ""
path_to_screenshots = ""
configfile = None

numbers_text = {
    1: ['один', 'одна', 'одного'],
    2: ['два', 'две', 'двух'],
    3: ['три', 'три', 'трёх'],
    4: ['четыре', 'четыре'],
    5: ['пять', 'пять', 'пяти'],
    6: ['шесть', 'шесть', 'шести'],
    7: ['семь', 'семь', 'семи'],
    8: ['восемь', 'восемь', 'восьми'],
    9: ['девять', 'девять', 'девяти'],
    10: ['десять', 'десять', 'десяти'],
    11: ['одинадцать', 'одинадцать', 'одинадцати'],
    12: ['двенадцать', 'двенадцать', 'двенадцати'],
    13: ['тринадцать', 'тринадцать', 'тринадцати'],
    14: ['четырнадцать', 'четырнадцать', 'четырнадцати'],
    15: ['пятнадцать', 'пятнадцать', 'пятнадцати'],
    16: ['шестнадцать', 'шестнадцать', 'шестнадцати'],
    17: ['семнадцать', 'семнадцать', 'семнадцати'],
    18: ['восемнадцать', 'восемнадцать', 'восемнадцати'],
    19: ['девятнадцать', 'девятнадцать', 'девятнадцати'],
    20: ['двадцать', 'двадцать', 'двадцати'],
    30: ['тридцать', 'тридцать', 'тридцати'],
    40: ['сОрок', 'сОрок', 'сорокА'],
    50: ['пятьдесят', 'пятьдесят', 'пятидесяти'],
    60: ['шестьдесят', 'шестьдесят', 'шестидесяти'],
    70: ["семьдесят", 'семьдесят', 'семидесяти'],
    80: ["восемьдесят", 'восемьдесят', 'восьмидесяти'],
    90: ["девяносто", 'девяносто', 'девяноста'],
    100: ["сто", 'сто', 'ста'],
    200: ["двести", 'двести', 'двухсот'],
    300: ["триста", 'триста', 'трёхсот'],
    400: ["четыреста", 'четыреста', 'четырёхсот'],
    500: ["пятьсот", 'пятьсот', 'пятисот'],
    600: ["шестьсот", 'шестьсот', 'шестисот'],
    700: ["семьсот", 'семьсот', 'семисот'],
    800: ["восемьсот", 'восемьсот', 'восмисот'],
    900: ["девятьсот", 'девятьсот', 'девятисот'],
    0: ['ноль', 'ноль', 'нуля'],
}

ends = {
    1: ('час', 'минута', 'градус', 'день', 'секунду', 'метр', "тысяча", 'градуса', "миллион", "рубль"),
    2: ('часа', 'минуты', 'градуса', 'дня', 'секунды', 'метра', "тысячи", 'градусов', 'миллиона', "рубля"),
    3: ('часа', 'минуты', 'градуса', 'дня', 'секунды', 'метра', "тысячи", 'градусов', 'миллиона', "рубля"),
    4: ('часа', 'минуты', 'градуса', 'дня', 'секунды', 'метра', "тысячи", 'градусов', 'миллиона', "рубля"),
    5: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    6: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    7: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    8: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    9: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    10: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    11: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    12: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    13: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    14: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей"),
    0: ('часов', 'минут', 'градусов', 'дней', 'секунд', 'метров', "тысяч", 'градусов', 'миллионов', "рублей")
}

cases_inflect = {
    1: ("nomn", "sing"),
    2: ("gent", "sing"),
    3: ("gent", "sing"),
    4: ("gent", "sing"),
    5: ("gent", "plur"),
    6: ("gent", "plur"),
    7: ("gent", "plur"),
    8: ("gent", "plur"),
    9: ("gent", "plur"),
    10: ("gent", "plur"),
    11: ("gent", "plur"),
    12: ("gent", "plur"),
    13: ("gent", "plur"),
    14: ("gent", "plur"),
    0: ("gent", "plur"),
}

months = {
    "январь": 1,
    "февраль": 2,
    "март": 3,
    "апрель": 4,
    "май": 5,
    "июнь": 6,
    "июль": 7,
    "август": 8,
    "сентябрь": 9,
    "октябрь": 10,
    "ноябрь": 11,
    "декабрь": 12,
}

months_ = {
    1: "январь",
    2: "февраль",
    3: "март",
    4: "апрель",
    5: "май",
    6: "июнь",
    7: "июль",
    8: "август",
    9: "сентябрь",
    10: "октябрь",
    11: "ноябрь",
    12: "декабрь"
}

data_number = {
    1: "первое",
    2: "второе",
    3: "третье",
    4: "четвёртое"
}

time_transform = {
    "час": 3600,
    "минута": 60,
    "секунда": 1
}

weather_id = {
    200: "Гроза, небольшой дождь",
    201: "Гроза с дождём",
    202: "Гроза, сильный дождь",
    210: "Слабая гроза",
    211: "Гроза",
    212: "Местами грозы",
    230: "Гроза, небольшой дождь",
    231: "Гроза, небольшой дождь",
    232: "Гроза с дождём",

    300: "Небольшой дождь",
    301: "Небольшой дождь",
    302: "Небольшой дождь",
    310: "Небольшой дождь",
    311: "Дождь",
    312: "Дождь",
    313: "Дождь",
    314: "Сильный дождь",
    321: "Дождь",

    500: "Небольшой дождь",
    501: "Дождь",
    502: "Сильный дождь",
    503: "Сильный дождь",
    504: "Ливень",
    511: "Град",
    520: "Ливень",
    521: "Ливень",
    522: "Ливень",
    531: "Местами осадки",

    600: "Небольшой снег",
    601: "Снег",
    602: "Снег",
    611: "Слякоть",
    612: "Слякоть",
    613: "Слякоть",
    615: "Снег с дождём",
    616: "Снег с дождём",
    620: "Лёгкий снегопад",
    621: "Снегопад",
    622: "Сильный снегопад",

    701: "Туман",
    711: "Смок",
    721: "Небольшой туман",
    731: "Песочная пыль",
    741: "Туман",
    751: "Песок",
    761: "Пыль",
    762: "Вулканическая пыль",
    771: "Шквалы",
    781: "Торнадо",

    800: "Чистое небо",

    801: "Немного облачно",
    802: "Облачно",
    803: "Облачно",
    804: "Пасмурно",
}

music_commands = ["play_favourite", "pause", "play", "repeat", "shuffle", "like", "dislike", "next_track",
                  "previous_track"]

wiki_removes = ['что такое', 'это', 'что значит']

ADV_list = ['завтра', 'послезавтра']